//============================================================
//
//	真っ直ぐ炎ヘッダー [fireNormal.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _FIRE_NORMAL_H_
#define _FIRE_NORMAL_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "object.h"
#include "fire.h"

//************************************************************
//	クラス定義
//************************************************************
// 真っ直ぐ炎クラス
class CFireNormal : public CFire
{
public:
	// コンストラクタ
	explicit CFireNormal(const EType type);

	// デストラクタ
	virtual ~CFireNormal();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了

protected:
	// オーバーライド関数
	void UpdateMove(void) override;	// 挙動の更新
};

#endif	// _FIRE_NORMAL_H_
